Revit 2027 API
Document.LoadFamilySymbol(String, String, FamilySymbol) Method
Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool LoadFamilySymbol(
	string filename,
	string name,
	out FamilySymbol symbol
)
Public Function LoadFamilySymbol (
	filename As String,
	name As String,
	<OutAttribute> ByRef symbol As FamilySymbol
) As Boolean
public:
bool LoadFamilySymbol(
	String^ filename,
	String^ name,
	[OutAttribute] FamilySymbol^% symbol
)
member LoadFamilySymbol :
        filename : string *
        name : string *
        symbol : FamilySymbol byref -> bool
Parameters
filename String
The fully qualified filename of the Family file, usually ending in .rfa.
name String
The name of the type/symbol to be loaded, such as "W11x14".
symbol FamilySymbol
A reference to the family symbol that was loaded if successful, otherwise null.
Return Value
Boolean
True if the family type/symbol was loaded successfully into the project, otherwise False.
Exceptions
Exception | Condition
ArgumentException |  Thrown when filename or name is null or empty.
Remarks
This function supports loading of types/symbols stored in the family, or those available in the family Type Catalog file.
See Also
Reference
Document Class
LoadFamilySymbol Overload
Autodesk.Revit.DB Namespace